; domain
(define (domain hiking)
  (:requirements :strips :typing)  ; 
  (:types 
    hiker 
    location
  )
  
  (:predicates 
    (at ?h - hiker ?l - location)
    (rained ?l - location)
    (has-energy ?h - hiker)
    (path-clear ?from ?to - location)
  )

  (:action walk
    :parameters (?h - hiker ?from ?to - location)
    :precondition (and 
      (at ?h ?from)
      (path-clear ?from ?to)
      (not (rained ?to)))
    :effect (and 
      (not (at ?h ?from))
      (at ?h ?to))
  )

  (:action rest
    :parameters (?h - hiker ?l - location)
    :effect (has-energy ?h)
  )

  (:action check-weather
    :parameters (?l - location)
    :effect (not (rained ?l))  ; 
  )
)

; problem
(define (problem hike-hard)
  (:domain hiking)
  (:objects
    h1 - hiker
    base rest-area danger-zone summit - location)
  (:init
    (at h1 base)
    (path-clear base rest-area)
    (path-clear rest-area danger-zone)
    (path-clear danger-zone summit)
    (rained danger-zone)
    (not (has-energy h1)))
  (:goal (at h1 summit)))

; plan
1. (check-weather danger-zone)
   deleted: (rained danger-zone)
   goals met: 0 of 1
2. (walk h1 base rest-area)
   deleted: (at h1 base)
   added: (at h1 rest-area)
   goals met: 0 of 1
3. (walk h1 rest-area danger-zone)
   deleted: (at h1 rest-area)
   added: (at h1 danger-zone)
   goals met: 0 of 1
4. (walk h1 danger-zone summit)
   deleted: (at h1 danger-zone)
   added: (at h1 summit)
   goals met: 1 of 1
